app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Foobar"], ["email", "foo@bar.com"], ["password", "foobar"], ["created_at", "2019-01-02 07:03:51.850349"], ["updated_at", "2019-01-02 07:03:51.850349"]]
---
  def create
    #@user = User.new(username: params[:username], email: params[:email], password: params[:password])
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "boofar"], ["updated_at", "2019-01-02 07:08:17.629748"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)

    if @user.save